redditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "this is the title"], ["url", "url.com"], ["content", "the content"], ["user_id", 1], ["created_at", "2018-12-02 02:30:46.853629"], ["updated_at", "2018-12-02 02:30:46.853629"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def require_user_owns_post!
    return if current_user.posts.find_by(id: params[:id])